Revit 2024 API
ImageTypeOptions.PageNumber Property
 The page in the file to be used for the image
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public int PageNumber { get; set; }
Visual Basic
Public Property PageNumber As Integer
	Get
	Set
Visual C++
public:
property int PageNumber {
	int get ();
	void set (int value);
}
Remarks
 The default value of this property is 1. This default is appropriate for most file types. This should be used for files, such as PDF files, that can have multiple pages. Valid values range from 1 to the number of pages in the file.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for pageNumber is not positive.
See Also
ImageTypeOptions Class
Autodesk.Revit.DB Namespace